---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.SketchFreeFormSet
source: html/a7b75eb7-262a-6668-2a9a-8e8ea306ca9b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.SketchFreeFormSet Property

Sketching of a free form set produces only a single bar.

## Syntax (C#)
```csharp
public static FailureDefinitionId SketchFreeFormSet { get; }
```